/*
数组:相同类型元素的集合.数组中每个元素类型都必须是相同的.

*/

#include <stdio.h>

int main(int argc, char const *argv[])
{
	int  arr[5] = {1,  3} ;//定义了一个数组,有5个元素
	int brr[0]; //零长数组,零长数组一般和结构体一起用
	//C语言中
	//1.C只有一维数组,而且数组的大小必须在编译期间作为常数确定下来,
	//但是C中,数组的元素可以是任何数据类型.
	//2.任何一个数组下标运算都是等同于一个对应的指针运算,哪怕越界.
	int crr[] ; //数组的大小未知,语法错误

	crr[] = {1, 2, 3, 4, 5};  //5 
	//如果数组中,后面元素缺省赋值,未被赋值的元素为0.
	//不能中间缺省.
	//arr[5] = {1, 2, 3, 4, 5};  //[5]  下标运算,取第六个元素
	 //arr[2]   数组是从0开始  
	//}
	//[2]  数组的下标,本质就是指针的运算.
	/* code */
	//arr[3] = 100; //第4个元素赋值为100
	3[arr] = 100;
	//arr[3]  arr地址3位   arr + 3
	//3地址偏移arr       3+ arr
	printf("arr[3]  = %d\n", arr[3]);

	arr[-1] = 88; //C语言中,数组越界是一个逻辑错误.
	//
	printf("a[-1] = %d\n", arr[-1]);


	printf("sizeof(arr) = %lu\n", sizeof(arr));
	//数组大小  每个元素所占的字节数 * 数组的元素个数
	//求一个数组元素的个数,数组的元素的类型未知.
	printf("数组有%d个元素\n",sizeof(arr)/sizeof(arr[0]) );
	return 0;
}

